cf_calendar_api/app/models/user.rb

SELECT DISTINCT "users".* FROM "users" INNER JOIN "user_types" ON "user_types"."user_id" = "users"."id" INNER JOIN "types" ON "types"."id" = "user_types"."type_id" INNER JOIN "calendar_entries" ON "calendar_entries"."user_id" = "users"."id" WHERE "types"."name" = $1 AND (day::DATE >= '2019-08-20'::DATE AND time >= '13:55'::TIME AND available IS TRUE) ORDER BY "users"."first_name" ASC  [["name", "mentor"]]
---
  scope :mentors, -> { joins("INNER JOIN student_mentors on users.id = student_mentors.mentor_id").distinct.order(:first_name) }

SELECT "calendar_entries".* FROM "calendar_entries" WHERE "calendar_entries"."user_id" = $1  [["user_id", 59]]
---
    def my_mentors_and_schedules(student_id)
      my_mentors(student_id).with_future_schedules.map do |mentor|
        entries = mentor.calendar_entries.select { |entry| entry.day >= Date.today && entry.time >= Time.now.to_s(:time)}