cf_calendar_api/app/controllers/students_controller.rb

  def show
    result = {
      student: User.find(student_params[:student_id]),
      mentors: User.my_mentors_and_schedules(student_params[:student_id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]